/** 学期信息 */

	/** 学期Id       */ private Integer termId   ;
	/** 学期编号     */ private String  termNO   ;
	/** 学期名称     */ private String  termName ;
	/** 开学日期     */ private Date    startDate;
	/** 结束日期     */ private Date    endDate  ;
	/** 首个周一日期 */ private Date    firstMon ;
	/** 周数         */ private Byte    weeks    ;
	/** 当前学期     */ private Byte    cur      ; //1=不是(默认) 2=是
	/** 备注         */ private String  remark   ;
	/** 状态         */ private Byte    state    ; //2正常(默认) 3关闭 4历史

	/** 排序字段 */ private String[] orderFd; //排序字段的名称，倒序前面加“@”，可以多个

	//==================================================================================================================
	// 查询
	//------------------------------------------------------------------------------------------------------------------
	/**<pre>
	 *   功能：查询
	 * 使用者：
	 *
	 * URL：p/term!query.action
	 *
	 * 参数
	 * start     可选   记录开始位置
	 * limit     可选   获取记录数量
	 * termId    可选   学期Id
	 * termNO    可选   学期编号
	 * termName  可选   学期名称
	 * weeks     可选   周数
	 * cur       可选   当前学期 1=不是(默认) 2=是
	 * remark    可选   备注
	 * state     可选   状态 2正常(默认) 3关闭 4历史
	 * orderFd   可选   排序字段的字段名称，倒序前面加“@”
	 *
	 * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
	 * 正确返回：{"success":true,"total":"总记录数","datalist":[Term]}
	 *
	 */

	//==================================================================================================================
	// 新增
	//------------------------------------------------------------------------------------------------------------------
	/**<pre>
	 *   功能：新增
	 * 使用者：
	 *
	 * URL：p/term!newRec.action
	 *
	 * 参数
	 * termNO     必需   学期编号
	 * termName   必需   学期名称
	 * startDate  可选   开学日期
	 * endDate    可选   结束日期
	 * firstMon   可选   首个周一日期
	 * weeks      可选   周数
	 * cur        可选   当前学期 1=不是(默认) 2=是
	 * remark     可选   备注
	 * state      可选   状态 2正常(默认) 3关闭 4历史
	 *
	 * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
	 * 正确返回：{"success":true,"data":{Term}}
	 *
	 */

	//==================================================================================================================
	// 修改
	//------------------------------------------------------------------------------------------------------------------
	/**<pre>
	 *   功能：修改
	 * 使用者：
	 *
	 * URL：p/term!edit.action
	 *
	 * 参数
	 * termId     必需   学期Id
	 * termNO     可选   学期编号
	 * termName   可选   学期名称
	 * startDate  可选   开学日期
	 * endDate    可选   结束日期
	 * firstMon   可选   首个周一日期
	 * weeks      可选   周数
	 * cur        可选   当前学期 1=不是(默认) 2=是
	 * remark     可选   备注
	 * state      可选   状态 2正常(默认) 3关闭 4历史
	 *
	 * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
	 * 正确返回：{"success":true,"message":"成功信息"}
	 *
	 */

	//==================================================================================================================
	// 删除
	//------------------------------------------------------------------------------------------------------------------
	/**<pre>
	 *   功能：删除
	 * 使用者：
	 *
	 * URL：p/term!del.action
	 *
	 * 参数
	 * termId   必需   学期Id
	 *
	 * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
	 * 正确返回：{"success":true,"message":"成功信息"}
	 *
	 */

	//==================================================================================================================
