/** 学生信息 */


	/** 学生Id       */ private Integer stuId   ;
	/** 学籍号       */ private String  stuNO   ;
	/** 学生姓名     */ private String  stuName ;
	/** 学生性别     */ private String  stuSex  ; //男(默认)、女
	/** 密码         */ private String  psw     ;
	/** 学分         */ private Double  credit  ;
	/** 学生班级Id   */ private Integer stuClaId; //-1代表未分配班级
	/** 学生年级     */ private Integer stuGrade; //就是入学年份，系统代码35
	/** 备注         */ private String  remark  ;
	/** 学生状态     */ private Byte    stuTo   ; //2正常(默认) 3休学 4退学 5毕业 系统代码(4)
	/** 学生记录状态 */ private Byte    stuState; //2正常(默认) 3关闭 4历史
	/** 班级编号     */ private String  claNO   ;
	/** 班级名称     */ private String  claName ;
	/** 班级年级     */ private Integer claGrade; //就是开班年份，系统代码(35)
	/** 班主任Id     */ private Integer masterId; //就是班主任的教师Id

	/** 排序字段     */ private String[] orderFd; //排序字段的名称，倒序前面加“@”，可以多个
	/** 旧密码       */ private String   oldPsw ;
	/** 新密码       */ private String   newPsw ;
	/** 学生Id(多个) */ private String   stuIds ; //多个Id用“,”隔开

	//==================================================================================================================
	// 查询
	//------------------------------------------------------------------------------------------------------------------
	/**<pre>
	 *   功能：查询
	 * 使用者：
	 *
	 * URL：p/stu!query.action
	 *
	 * 参数
	 * start     可选   记录开始位置
	 * limit     可选   获取记录数量
	 * stuId     可选   学生Id
	 * stuNO     可选   学籍号
	 * stuName   可选   学生姓名
	 * stuSex    可选   学生性别 男(默认)、女
	 * psw       可选   密码
	 * credit    可选   学分
	 * stuClaId  可选   学生班级Id -1代表未分配班级
	 * stuGrade  可选   学生年级 就是入学年份，系统代码35
	 * remark    可选   备注
	 * stuTo     可选   2正常(默认) 3休学 4退学 5毕业
	 * stuState  可选   学生记录状态 2正常(默认) 3关闭 4历史
	 * orderFd   可选   排序字段的字段名称，倒序前面加“@”
	 *
	 * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
	 * 正确返回：{"success":true,"total":"总记录数","datalist":[Student]}
	 *
	 */

	//==================================================================================================================
	// 查询2 -- 增加班级内容
	//------------------------------------------------------------------------------------------------------------------
	/**<pre>
	 *   功能：查询2 -- 增加班级内容
	 * 使用者：
	 *
	 * URL：p/stu!query2.action
	 *
	 * 参数
	 * start     可选   记录开始位置
	 * limit     可选   获取记录数量
	 * stuId     可选   学生Id
	 * stuNO     可选   学籍号
	 * stuName   可选   学生姓名
	 * stuSex    可选   学生性别 男(默认)、女
	 * psw       可选   密码
	 * credit    可选   学分
	 * stuClaId  可选   学生班级Id -1代表未分配班级
	 * stuGrade  可选   学生年级 就是入学年份，系统代码35
	 * remark    可选   备注
	 * stuTo     可选   2正常(默认) 3休学 4退学 5毕业
	 * stuState  可选   学生记录状态 2正常(默认) 3关闭 4历史
	 * claNO     可选   班级编号
	 * claName   可选   班级名称
	 * claGrade  可选   班级年级 就是开班年份，系统代码(35)
	 * masterId  可选   班主任Id 就是班主任的教师Id
	 * orderFd   可选   排序字段的字段名称，倒序前面加“@”
	 *
	 * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
	 * 正确返回：{"success":true,"total":"总记录数","datalist":[V_Student]}
	 *
	 */

	//==================================================================================================================
	// 新增
	//------------------------------------------------------------------------------------------------------------------
	/**<pre>
	 *   功能：新增
	 * 使用者：
	 *
	 * URL：p/stu!newRec.action
	 *
	 * 参数
	 * stuNO     必需   学籍号
	 * stuName   必需   学生姓名
	 * stuSex    可选   学生性别 男(默认)、女
	 * psw       可选   密码
	 * credit    可选   学分
	 * stuClaId  可选   学生班级Id
	 * stuGrade  可选   学生年级
	 * remark    可选   备注
	 * stuTo     可选   2正常(默认) 3休学 4退学 5毕业
	 * stuState  可选   学生记录状态 2正常(默认) 3关闭 4历史
	 *
	 * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
	 * 正确返回：{"success":true,"data":{Student}}
	 *
	 */

	//==================================================================================================================
	// 修改
	//------------------------------------------------------------------------------------------------------------------
	/**<pre>
	 *   功能：修改
	 * 使用者：
	 *
	 * URL：p/stu!edit.action
	 *
	 * 参数
	 * stuId     必需   学生Id
	 * stuNO     可选   学籍号
	 * stuName   可选   学生姓名
	 * stuSex    可选   学生性别 男(默认)、女
	 * psw       可选   密码
	 * credit    可选   学分
	 * stuClaId  可选   学生班级Id
	 * stuGrade  可选   学生年级
	 * remark    可选   备注
	 * stuTo     可选   2正常(默认) 3休学 4退学 5毕业
	 * stuState  可选   学生记录状态 2正常 3关闭 4历史
	 *
	 * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
	 * 正确返回：{"success":true,"message":"成功信息"}
	 *
	 */

	//==================================================================================================================
	// 删除
	//------------------------------------------------------------------------------------------------------------------
	/**<pre>
	 *   功能：删除  注意：不能删除“2正常，3关闭”这2种状态的数据
	 * 使用者：
	 *
	 * URL：p/stu!del.action
	 *
	 * 参数
     * stuIds   必需   学生Id，多个用“,”隔开
	 *
	 * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
	 * 正确返回：{"success":true,"message":"成功信息"}
	 *
	 */

	//==================================================================================================================
	// 修改自己密码
	//------------------------------------------------------------------------------------------------------------------
    /**<pre>
     *   功能：修改自己密码
     *
     * URL：p/stu!changePsw.action
     *
     * 参数：
     * oldPsw   必需   旧的密码
     * newPsw   必需   新的密码
     *
     * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
     * 正确返回：{"success":true,"message":"成功信息"}
     *
     */

	//==================================================================================================================
	// 重置密码为
	//------------------------------------------------------------------------------------------------------------------
    /**<pre>
     *   功能：重置密码为
     * 使用者：管理员
     *
     * URL：p/stu!resetPsw.action
     *
     * 参数：
     * stuIds   必需   学生Id，多个用“,”隔开
     *
     * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
     * 正确返回：{"success":true,"message":"成功信息"}
     *
     */

    //==================================================================================================================
    // 下载数据模板(学生信息)
    //------------------------------------------------------------------------------------------------------------------
    /**<pre>
     *   功能：下载数据模板(学生信息)
     * 使用者：
     *
     * URL：p/stu!downExcelModel.action
     *
     * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
     * 正确返回：文件
     *
     */

    //==================================================================================================================
    // 导入：学生信息
    //------------------------------------------------------------------------------------------------------------------
    /**<pre>
     *   功能：学生信息
     * 使用者：
     *
     * URL：p/stu!importExcel.action
     *
     * 参数：
     * file     必需   文件
     * type     可选   1新增(不允许与已有的重复)、2覆盖
     * doType   可选   1=班级编号不存在时创建班级，否则抛出异常终止导入
     *
     * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
     * 正确返回：{"success":true,"message":"文字信息"}
     *
     */

	//==================================================================================================================
