/** 教师权限 */

	/** 教师Id */ private Integer thrId  ;
	/** 用户组 */ private Integer userGrp; //系统编码(20)

	/** 教师编号     */ private String  thrNO    ;
	/** 教师姓名     */ private String  thrName  ;
	/** 教师性别     */ private String  thrSex   ; //男(默认)、女
	/** 教师密码     */ private String  psw      ;
	/** 教师简介     */ private String  explain  ;
	/** 备注         */ private String  remark   ;
	/** 教师状态     */ private Byte    thrTo    ; //2正常(默认) 3休假 4辞职 9退休
	/** 教师记录状态 */ private Byte    thrState ; //2正常(默认) 3关闭 4历史
	/** 名称         */ private String  userGrpNm;

	/** 排序字段 */ private String[] orderFd; //排序字段的名称，倒序前面加“@”，可以多个

	//==================================================================================================================
	// 查询
	//------------------------------------------------------------------------------------------------------------------
	/**<pre>
	 *   功能：查询
	 * 使用者：
	 *
	 * URL：p/thrPow!query.action
	 *
	 * 参数
	 * start        可选   记录开始位置
	 * limit        可选   获取记录数量
	 * thrId        可选   教师Id
	 * userGrp      可选   用户组
	 * orderFd      可选   排序字段的字段名称，倒序前面加“@”
	 *
	 * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
	 * 正确返回：{"success":true,"total":"总记录数","datalist":[ThrPower]}
	 *
	 */

	//==================================================================================================================
	// 查询2 -- 引入：教师、用户组名称
	//------------------------------------------------------------------------------------------------------------------
	/**<pre>
	 *   功能：查询2 -- 引入：教师、用户组名称
	 * 使用者：
	 *
	 * URL：p/thrPow!query2.action
	 *
	 * 参数
	 * start        可选   记录开始位置
	 * limit        可选   获取记录数量
	 * thrId        可选   教师Id
	 * thrNO        可选   教师编号
	 * thrName      可选   教师姓名
	 * thrSex       可选   教师性别 男(默认)、女
	 * psw          可选   教师密码
	 * explain      可选   教师简介
	 * remark       可选   备注
	 * thrTo        可选   教师状态 2正常(默认) 3休假 4辞职 9退休
	 * thrState     可选   教师记录状态 2正常(默认) 3关闭 4历史
	 * userGrp      可选   用户组
	 * userGrpNm    可选   名称
	 * orderFd      可选   排序字段的字段名称，倒序前面加“@”
	 *
	 * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
	 * 正确返回：{"success":true,"total":"总记录数","datalist":[V_ThrPower]}
	 *
	 */

	//==================================================================================================================
	// 新增
	//------------------------------------------------------------------------------------------------------------------
	/**<pre>
	 *   功能：新增
	 * 使用者：
	 *
	 * URL：p/thrPow!newRec.action
	 *
	 * 参数
	 * thrId    必需   教师Id
	 * userGrp  必需   用户组
	 *
	 * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
	 * 正确返回：{"success":true,"data":{ThrPower}}
	 *
	 */

	//==================================================================================================================
	// 删除
	//------------------------------------------------------------------------------------------------------------------
	/**<pre>
	 *   功能：删除
	 * 使用者：
	 *
	 * URL：p/thrPow!del.action
	 *
	 * 参数
	 * thrId    必需   教师Id
	 * userGrp  必需   用户组
	 *
	 * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
	 * 正确返回：{"success":true,"message":"成功信息"}
	 *
	 */

	//==================================================================================================================
