/** 教学场地 */

	/** 场地Id   */ private Integer romId  ;
	/** 场地编号 */ private String  romNO  ;
	/** 场地名称 */ private String  romName;
	/** 教室类型 */ private Integer romType; //代码类型46
	/** 教学楼   */ private Integer buiId  ;
	/** 座位数量 */ private Short   seatNum;
	/** 备注     */ private String  remark ;
	/** 场地状态 */ private Byte    state  ; //2正常(默认)、3关闭、4历史

	/** 教学楼编号 */ private String  buiNO  ;
	/** 教学楼名称 */ private String  buiName;

	/** 排序字段   */ private String[] orderFd; //排序字段的名称，倒序前面加“@”，可以多个
	/** 场地Id(组) */ private String   romIds ; //多个用“,”隔开

	//==================================================================================================================
	// 查询
	//------------------------------------------------------------------------------------------------------------------
	/**<pre>
	 *   功能：查询
	 * 使用者：
	 *
	 * URL：p/rom!query.action
	 *
	 * 参数
	 * start        可选   记录开始位置
	 * limit        可选   获取记录数量
	 * romId        可选   场地Id
	 * romNO        可选   场地编号
	 * romName      可选   场地名称
	 * romType      可选   教室类型 代码类型46
	 * buiId        可选   教学楼
	 * seatNum      可选   座位数量
	 * remark       可选   备注
	 * state        可选   场地状态 2正常(默认)、3关闭、4历史
	 * orderFd      可选   排序字段的字段名称，倒序前面加“@”
	 *
	 * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
	 * 正确返回：{"success":true,"total":"总记录数","datalist":[Room]}
	 *
	 */

	//==================================================================================================================
	// 查询2 -- 详细信息：引入教学楼信息
	//------------------------------------------------------------------------------------------------------------------
	/**<pre>
	 *   功能：查询2 -- 详细信息：引入教学楼信息
	 * 使用者：
	 *
	 *  URL：p/rom!query2.action
	 *
	 * 参数
	 * start        可选   记录开始位置
	 * limit        可选   获取记录数量
	 * romId        可选   场地Id
	 * romNO        可选   场地编号
	 * romName      可选   场地名称
	 * romType      可选   教室类型 代码类型46
	 * buiId        可选   教学楼
	 * seatNum      可选   座位数量
	 * remark       可选   备注
	 * state        可选   场地状态 2正常(默认)、3关闭、4历史
	 * buiNO        可选   教学楼编号
	 * buiName      可选   教学楼名称
	 * orderFd      可选   排序字段的字段名称，倒序前面加“@”
	 *
	 * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
	 * 正确返回：{"success":true,"total":"总记录数","datalist":[V_Room]}
	 *
	 */

	//==================================================================================================================
	// 新增
	//------------------------------------------------------------------------------------------------------------------
	/**<pre>
	 *   功能：新增
	 * 使用者：
	 *
	 * URL：p/rom!newRec.action
	 *
	 * 参数
	 * romNO     必需   场地编号
	 * romName   必需   场地名称
	 * romType   可选   教室类型 代码类型46
	 * buiId     可选   教学楼
	 * seatNum   可选   座位数量
	 * remark    可选   备注
	 *
	 * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
	 * 正确返回：{"success":true,"message":"成功能信息","data":{Room}}
	 *
	 */

	//==================================================================================================================
	// 修改
	//------------------------------------------------------------------------------------------------------------------
	/**<pre>
	 *   功能：修改
	 * 使用者：
	 *
	 * URL：p/rom!edit.action
	 *
	 * 参数
	 * romId     必需   场地Id
	 * romNO     可选   场地编号
	 * romName   可选   场地名称
	 * romType   可选   教室类型 代码类型46
	 * buiId     可选   教学楼
	 * seatNum   可选   座位数量
	 * remark    可选   备注
	 *
	 * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
	 * 正确返回：{"success":true,"message":"成功信息"}
	 *
	 */

	//==================================================================================================================
	// 修改记录状态
	//------------------------------------------------------------------------------------------------------------------
	/**<pre>
	 *   功能：修改记录状态
	 * 使用者：
	 *
	 * URL：p/rom!chState.action
	 *
	 * 参数
	 * romIds   必需   场地Id 多个用“,”隔开
	 * state    必需   状态值
	 *
	 * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
	 * 正确返回：{"success":true,"message":"成功信息"}
	 *
	 */

	//==================================================================================================================
	// 删除
	//------------------------------------------------------------------------------------------------------------------
	/**<pre>
	 *   功能：删除
	 * 使用者：
	 *
	 * URL：p/rom!del.action
	 *
	 * 参数
	 * romIds   必需   场地Id 多个用“,”隔开
	 *
	 * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
	 * 正确返回：{"success":true,"message":"成功信息"}
	 *
	 */

	//==================================================================================================================
