/** 教师信息 */


	/** 教师Id       */ private Integer thrId   ;
	/** 教师编号     */ private String  thrNO   ;
	/** 教师姓名     */ private String  thrName ;
	/** 教师性别     */ private String  thrSex  ; //男(默认)、女
	/** 教师密码     */ private String  psw     ;
	/** 教师简介     */ private String  explain ;
	/** 备注         */ private String  remark  ;
	/** 教师状态     */ private Byte    thrTo   ; //系统代码5：2正常(默认) 3休假 4辞职 9退休
	/** 教师记录状态 */ private Byte    thrState; //2正常(默认) 3关闭 4历史

	/** 排序字段     */ private String[] orderFd; //排序字段的名称，倒序前面加“@”，可以多个
	/** 旧密码       */ private String   oldPsw ;
	/** 新密码       */ private String   newPsw ;
	/** 教师Id(多个) */ private String   thrIds ; //多个Id用“,”隔开

	//==================================================================================================================
	// 查询
	//------------------------------------------------------------------------------------------------------------------
	/**<pre>
	 *   功能：查询
	 * 使用者：
	 *
	 * URL：p/thr!query.action
	 *
	 * 参数
	 * start     可选   记录开始位置
	 * limit     可选   获取记录数量
	 * thrId     可选   教师Id
	 * thrNO     可选   教师编号
	 * thrName   可选   教师姓名
	 * thrSex    可选   教师性别 男(默认)、女
	 * psw       可选   教师密码
	 * explain   可选   教师简介
	 * remark    可选   备注
	 * thrTo     可选   教师状态 2正常(默认) 3休假 4辞职 9退休
	 * thrState  可选   教师记录状态 2正常(默认) 3关闭 4历史
	 * orderFd   可选   排序字段的字段名称，倒序前面加“@”
	 *
	 * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
	 * 正确返回：{"success":true,"total":"总记录数","datalist":[Teacher]}
	 *
	 */

	//==================================================================================================================
	// 基本查询
	//------------------------------------------------------------------------------------------------------------------
	/**<pre>
	 *   功能：基本查询
	 * 使用者：所有
	 *
	 * URL：p/thr!basQuery.action
	 *
	 * 参数
	 * thrId     必需   教师Id
	 *
	 * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
	 * 正确返回：{"success":true,"data":{Teacher}}
	 *
	 */
	
	//==================================================================================================================
	// 新增
	//------------------------------------------------------------------------------------------------------------------
	/**<pre>
	 *   功能：新增
	 * 使用者：
	 *
	 * URL：p/thr!newRec.action
	 *
	 * 参数
	 * thrNO     必需   教师编号
	 * thrName   必需   教师姓名
	 * thrSex    可选   教师性别 男(默认)、女
	 * psw       可选   教师密码
	 * explain   可选   教师简介
	 * remark    可选   备注
	 * thrTo     可选   教师状态 2正常(默认) 3休假 4辞职 9退休
	 * thrState  可选   教师记录状态 2正常(默认) 3关闭 4历史
	 *
	 * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
	 * 正确返回：{"success":true,"data":{Teacher}}
	 *
	 */

	//==================================================================================================================
	// 修改
	//------------------------------------------------------------------------------------------------------------------
	/**<pre>
	 *   功能：修改
	 * 使用者：
	 *
	 * URL：p/thr!edit.action
	 *
	 * 参数
	 * thrId     必需   教师Id
	 * thrNO     可选   教师编号
	 * thrName   可选   教师姓名
	 * thrSex    可选   教师性别 男(默认)、女
	 * psw       可选   教师密码
	 * explain   可选   教师简介
	 * remark    可选   备注
	 * thrTo     可选   教师状态 2正常(默认) 3休假 4辞职 9退休
	 * thrState  可选   教师记录状态 2正常 3关闭 4历史
	 *
	 * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
	 * 正确返回：{"success":true,"message":"成功信息"}
	 *
	 */

	//==================================================================================================================
	// 修改自已的信息
	//------------------------------------------------------------------------------------------------------------------
	/**<pre>
	 *   功能：修改自已的信息
	 * 使用者：
	 *
	 * URL：p/thr!editMy.action
	 *
	 * 参数
	 * thrNO     可选   教师编号
	 * thrName   可选   教师姓名
	 * thrSex    可选   教师性别 男(默认)、女
	 * psw       可选   教师密码
	 * explain   可选   教师简介
	 * remark    可选   备注
	 *
	 * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
	 * 正确返回：{"success":true,"message":"成功信息"}
	 *
	 */

	//==================================================================================================================
	// 删除
	//------------------------------------------------------------------------------------------------------------------
	/**<pre>
	 *   功能：删除  注意：不能删除“2正常，3关闭”这2种状态的数据
	 * 使用者：
	 *
	 * URL：p/thr!del.action
	 *
	 * 参数
     * thrIds   必需   教师Id，多个用“,”隔开
	 *
	 * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
	 * 正确返回：{"success":true,"message":"成功信息"}
	 *
	 */

	//==================================================================================================================
	// 修改自己密码
	//------------------------------------------------------------------------------------------------------------------
    /**<pre>
     *   功能：修改自己密码
     *
     * URL：p/thr!changePsw.action
     *
     * 参数：
     * oldPsw   必需   旧的密码
     * newPsw   必需   新的密码
     *
     * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
     * 正确返回：{"success":true,"message":"成功信息"}
     *
     */

	//==================================================================================================================
	// 重置密码为
	//------------------------------------------------------------------------------------------------------------------
    /**<pre>
     *   功能：重置密码为
     * 使用者：管理员
     *
     * URL：p/thr!resetPsw.action
     *
     * 参数：
     * thrIds   必需   教师Id，多个用“,”隔开
     *
     * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
     * 正确返回：{"success":true,"message":"成功信息"}
     *
     */

    //==================================================================================================================
    // 下载数据模板(教师信息)
    //------------------------------------------------------------------------------------------------------------------
    /**<pre>
     *   功能：下载数据模板(教师信息)
     * 使用者：高级用户
     *
     * URL：p/thr!downExcelModel.action
     *
     * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
     * 正确返回：文件
     *
     */

    //==================================================================================================================
    // 导入：教师信息
    //------------------------------------------------------------------------------------------------------------------
    /**<pre>
     *   功能：教师信息
     * 使用者：
     *
     * URL：p/thr!importExcel.action
     *
     * 参数：
     * file   必需   文件
     * type   可选   1新增(不允许与已有的重复)、2覆盖
     *
     * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
     * 正确返回：{"success":true,"message":"文字信息"}
     *
     */

	//==================================================================================================================
