/** 班级信息 */

	/** 班级Id       */ private Integer claId   ;
	/** 班级编号     */ private String  claNO   ;
	/** 班级名称     */ private String  claName ;
	/** 年级编码     */ private Integer claGrade; //就是开班年份，系统代码(35)
	/** 班主任Id     */ private Integer masterId; //就是班主任的教师Id
	/** 备注         */ private String  remark  ;
	/** 班级记录状态 */ private Byte    claState; //2正常(默认) 3关闭 4历史

	/** 排序字段     */ private String[] orderFd; //排序字段的名称，倒序前面加“@”，可以多个
	/** 班级Id(多个) */ private String   claIds ; //多个Id用“,”隔开

	//==================================================================================================================
	// 查询
	//------------------------------------------------------------------------------------------------------------------
	/**<pre>
	 *   功能：查询
	 * 使用者：
	 *
	 * URL：p/cla!query.action
	 *
	 * 参数
	 * start     可选   记录开始位置
	 * limit     可选   获取记录数量
	 * claId     可选   班级Id
	 * claNO     可选   班级编号
	 * claName   可选   班级名称
	 * claGrade  可选   年级编码
	 * masterId  可选   班主任Id
	 * remark    可选   备注
	 * claState  可选   班级记录状态 2正常 3关闭 4历史
	 * orderFd   可选   排序字段的字段名称，倒序前面加“@”
	 *
	 * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
	 * 正确返回：{"success":true,"total":"总记录数","datalist":[Clazz]}
	 *
	 */

	//==================================================================================================================
	// 新增
	//------------------------------------------------------------------------------------------------------------------
	/**<pre>
	 *   功能：新增
	 * 使用者：
	 *
	 * URL：p/cla!newRec.action
	 *
	 * 参数
	 * claNO     必需   班级编号
	 * claName   必需   班级名称
	 * claGrade  可选   年级编码
	 * masterId  可选   班主任Id
	 * remark    可选   备注
	 * claState  可选   班级记录状态 2正常(默认) 3关闭 4历史
	 *
	 * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
	 * 正确返回：{"success":true,"data":{Clazz}}
	 *
	 */

	//==================================================================================================================
	// 修改
	//------------------------------------------------------------------------------------------------------------------
	/**<pre>
	 *   功能：修改
	 * 使用者：
	 *
	 * URL：p/cla!edit.action
	 *
	 * 参数
	 * claId     必需   班级Id
	 * claNO     可选   班级编号
	 * claName   可选   班级名称
	 * claGrade  可选   年级编码
	 * masterId  可选   班主任Id
	 * remark    可选   备注
	 * claState  可选   班级记录状态 2正常(默认) 3关闭 4历史
	 *
	 * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
	 * 正确返回：{"success":true,"message":"成功信息"}
	 *
	 */

	//==================================================================================================================
	// 删除
	//------------------------------------------------------------------------------------------------------------------
	/**<pre>
	 *   功能：删除  注意：不能删除“2正常，3关闭”这2种状态的数据
	 * 使用者：
	 *
	 * URL：p/cla!del.action
	 *
	 * 参数
	 * claIds   必需   班级Id 多个Id用“,”隔开
	 *
	 * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
	 * 正确返回：{"success":true,"message":"成功信息"}
	 *
	 */

	//==================================================================================================================
