/** 社会机构 */

	/** 社会机构Id   */ private Integer socId   ;
	/** 社会机构编号 */ private String  socNO   ;
	/** 社会机构名称 */ private String  socName ;
	/** 登录密码     */ private String  psw     ;
	/** 社会机构简介 */ private String  explain ;
	/** 备注         */ private String  remark  ;
	/** 机构记录状态 */ private Byte    socState; //2正常(默认) 3关闭 4历史

	/** 排序字段     */ private String[] orderFd; //排序字段的名称，倒序前面加“@”，可以多个
	/** 旧密码       */ private String   oldPsw ;
	/** 新密码       */ private String   newPsw ;
	/** 机构Id(多个) */ private String   socIds ; //多个Id用“,”隔开

	//==================================================================================================================
	// 查询
	//------------------------------------------------------------------------------------------------------------------
	/**<pre>
	 *   功能：查询
	 * 使用者：
	 *
	 * URL：p/soc!query.action
	 *
	 * 参数
	 * start     可选   记录开始位置
	 * limit     可选   获取记录数量
	 * socId     可选   社会机构Id
	 * socNO     可选   社会机构编号
	 * socName   可选   社会机构名称
	 * psw       可选   登录密码
	 * explain   可选   社会机构简介
	 * remark    可选   备注
	 * socState  可选   机构记录状态 2正常(默认) 3关闭 4历史
	 * orderFd   可选   排序字段的字段名称，倒序前面加“@”
	 *
	 * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
	 * 正确返回：{"success":true,"total":"总记录数","datalist":[Society]}
	 *
	 */

	//==================================================================================================================
	// 新增
	//------------------------------------------------------------------------------------------------------------------
	/**<pre>
	 *   功能：新增
	 * 使用者：
	 *
	 * URL：p/soc!newRec.action
	 *
	 * 参数
	 * socNO     必需   社会机构编号
	 * socName   必需   社会机构名称
	 * psw       可选   登录密码
	 * explain   可选   社会机构简介
	 * remark    可选   备注
	 * socState  可选   机构记录状态 2正常(默认) 3关闭 4历史
	 *
	 * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
	 * 正确返回：{"success":true,"data":{Society}}
	 *
	 */

	//==================================================================================================================
	// 修改
	//------------------------------------------------------------------------------------------------------------------
	/**<pre>
	 *   功能：修改
	 * 使用者：
	 *
	 * URL：p/soc!edit.action
	 *
	 * 参数
	 * socId     必需   社会机构Id
	 * socNO     可选   社会机构编号
	 * socName   可选   社会机构名称
	 * psw       可选   登录密码
	 * explain   可选   社会机构简介
	 * remark    可选   备注
	 * socState  可选   机构记录状态 2正常 3关闭 4历史
	 *
	 * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
	 * 正确返回：{"success":true,"message":"成功信息"}
	 *
	 */

	//==================================================================================================================
	// 删除
	//------------------------------------------------------------------------------------------------------------------
	/**<pre>
	 *   功能：删除  注意：不能删除“2正常，3关闭”这2种状态的数据
	 * 使用者：
	 *
	 * URL：p/soc!del.action
	 *
	 * 参数
	 * socIds   必需   社会机构Id，多个用“,”隔开
	 *
	 * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
	 * 正确返回：{"success":true,"message":"成功信息"}
	 *
	 */

	//==================================================================================================================
	// 修改自己密码
	//------------------------------------------------------------------------------------------------------------------
    /**<pre>
     *   功能：修改自己密码
     *
     * URL：p/soc!changePsw.action
     *
     * 参数：
     * oldPsw   必需   旧的密码
     * newPsw   必需   新的密码
     *
     * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
     * 正确返回：{"success":true,"message":"成功信息"}
     *
     */

	//==================================================================================================================
	// 重置密码为
	//------------------------------------------------------------------------------------------------------------------
    /**<pre>
     *   功能：重置密码为
     * 使用者：管理员
     *
     * URL：p/soc!resetPsw.action
     *
     * 参数：
     * socIds   必需   机构Id，多个用“,”隔开
     *
     * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
     * 正确返回：{"success":true,"message":"成功信息"}
     *
     */

	//==================================================================================================================
