/** 系统设置 */

	/** 配置名称 */ private String name   ;
	/** 配置值   */ private String value  ;
	/** 值类型   */ private Byte   valType; //1字符串(默认) 2整数 3长整数 4浮点数 5日期(yyyy-MM-dd HH:mm:ss)

	/** 排序字段 */ private String[] orderFd; //排序字段的名称，倒序前面加“@”，可以多个

	//==================================================================================================================
	// 查询
	//------------------------------------------------------------------------------------------------------------------
	/**<pre>
	 *   功能：查询
	 *
	 * URL：p/sysSet!query.action
	 *
	 * 参数
	 * start    可选   记录开始位置
	 * limit    可选   获取记录数量
	 * name     可选   配置名称
	 * value    可选   配置值
	 * valType  可选   值类型 1字符串(默认) 2整数 3长整数 4浮点数 5日期(yyyy-MM-dd HH:mm:ss)
	 * orderFd  可选   排序字段的字段名称，倒序前面加“@”
	 *
	 * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
	 * 正确返回：{"success":true,"total":"总记录数","datalist":[SysSet]}
	 *
	 */

	//==================================================================================================================
	// 新增
	//------------------------------------------------------------------------------------------------------------------
	/**<pre>
	 *   功能：新增
	 * 使用者：
	 *
	 * URL：p/sysSet!newRec.action
	 *
	 * 参数
	 * name     必需   配置名称
	 * value    可选   配置值
	 * valType  可选   值类型 1字符串(默认) 2整数 3长整数 4浮点数 5日期(yyyy-MM-dd HH:mm:ss)
	 *
	 * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
	 * 正确返回：{"success":true,"data":{SysSet}}
	 *
	 */

	//==================================================================================================================
	// 修改
	//------------------------------------------------------------------------------------------------------------------
	/**<pre>
	 *   功能：修改
	 * 使用者：
	 *
	 * URL：p/sysSet!edit.action
	 *
	 * 参数
	 * name     必需   配置名称
	 * value    可选   配置值
	 * valType  可选   值类型 1字符串(默认) 2整数 3长整数 4浮点数 5日期(yyyy-MM-dd HH:mm:ss)
	 *
	 * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
	 * 正确返回：{"success":true,"message":"成功信息"}
	 *
	 */

	//==================================================================================================================
	// 删除
	//------------------------------------------------------------------------------------------------------------------
	/**<pre>
	 *   功能：删除
	 * 使用者：
	 *
	 * URL：p/sysSet!del.action
	 *
	 * 参数
	 * name   必需  配置项
	 *
	 * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
	 * 正确返回：{"success":true,"message":"成功信息"}
	 *
	 */

	//==================================================================================================================
