/** 系统代码 */

    /** 代码类型 */ private Integer type  ;
    /** 代码     */ private Integer code  ;
    /** 编号     */ private String  nO    ;
    /** 名称     */ private String  name  ;
    /** 系数     */ private Double  ratio ;
    /** 备注     */ private String  remark;
	/** 状态     */ private Byte    state ; //2正常(默认) 3关闭 4历史

    /** 按编号排序 */ private Byte orderO;
    /** 按名称排序 */ private Byte orderN;
    /** 按系数排序 */ private Byte orderR;

    //==================================================================================================================
    //查询
    //------------------------------------------------------------------------------------------------------------------
    /**<pre>
     *   功能：查询
     * 使用者：无限制
     *
     * URL：p/code!query.action
     *
     * 参数：
     * start      可选   记录开始位置
     * limit      可选   获取记录数量
     * type       可选   代码类型
     * code       可选   代码
     * nO         可选   编号(模糊匹配)
     * name       可选   名称(模糊匹配)
     * state      可选   2正常 3关闭 4历史
     * orderO     可选   按编号排序：1从小到大、2从大到小
     * orderN     可选   按名称排序：1从小到大、2从大到小
     * orderR     可选   按系数排序：1从小到大、2从大到小
     *
     * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
     * 正确返回：{"success":true,"total":"总记录数","datalist":[Code]}
     *
     */

    //==================================================================================================================
    //新增
    //------------------------------------------------------------------------------------------------------------------
    /**<pre>
     *   功能：新增
     * 使用者：管理员
     *
     * URL：p/code!newRec.action
     *
     * 参数：
     * type      必需   代码类型
     * code      可选   代码 不指定，将默认对当前最大代码进行递增
     * nO        可选   编号
     * name      必需   名称
     * ratio     可选   系数
     * remark    可选   备注
     * state     可选   2正常(默认) 3关闭 4历史
     *
     * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
     * 正确返回：{"success":true,"message":"成功信息"}
     *
     */

    //==================================================================================================================
    //修改
    //------------------------------------------------------------------------------------------------------------------
    /**<pre>
     *   功能：修改
     * 使用者：管理员
     *
     * URL：p/code!edit.action
     *
     * 参数：
     * type      必需   代码类型
     * code      必需   代码
     * nO        可选   编号
     * name      可选   名称
     * ratio     可选   系数
     * remark    可选   备注
     * state     可选   2正常 3关闭 4历史
     *
     * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
     * 正确返回：{"success":true,"message":"成功信息"}
     *
     */

    //==================================================================================================================
    //删除
    //------------------------------------------------------------------------------------------------------------------
    /**<pre>
     *   功能：删除
     * 使用者：管理员
     *
     * URL：p/code!del.action
     *
     * 参数：
     * type    必需   代码类型
     * code    必需   代码
     *
     * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
     * 正确返回：{"success":true,"message":"成功信息"}
     *
     */
    
    //==================================================================================================================
