/** 学生选课 */

	/** 学期Id       */ private Integer termId    ;
	/** 选课计划名称 */ private String  planName  ;
	/** 待选课Id     */ private Integer selCouId  ;
	/** 选课计划Id   */ private Integer xkpId     ;
	/** 课程类型     */ private Integer couType   ; //系统代码11 2普通(默认) 4自修研习
	/** 父课程Id     */ private Integer parCouId  ;
	/** 课程编号     */ private String  couNO     ;
	/** 课程名称     */ private String  couName   ;
	/** 课程简介     */ private String  couExplain;
	/** 最低学分     */ private Double  creditMin ;
	/** 人数上限     */ private Short   manMax    ; //默认-1代表无限制
	/** 男生上限     */ private Short   boyMax    ; //默认-1代表无限制
	/** 女生上限     */ private Short   girlMax   ; //默认-1代表无限制
	/** 当前男生数   */ private Short   boyNum    ;
	/** 当前女生数   */ private Short   girlNum   ;
	/** 审核状态     */ private Byte    audit     ; //1未审核(默认) 2已审核
	/** 开课状态     */ private Byte    couState  ; //2开启(可选)(默认) 3关闭(不可选) 4确认 5完成
	/** 子课程数量   */ private Long    chiNum    ;
	/** 教师Id(组)   */ private String  couThrIds ;
	/** 教师姓名(组) */ private String  couThrNms ;

	/** 排序字段 */ private String[] orderFd; //排序字段的名称，倒序前面加“@”，可以多个
	/** 类型     */ private Byte     type   ;

	//==================================================================================================================
	// 未评价课程
	//------------------------------------------------------------------------------------------------------------------
	/**<pre>
	 *   功能：未评价课程，当前学期之前的学期，已确认选课，未进行评价的课程
	 * 使用者：学生
	 *
	 * URL：p/stuXk!unEvalCou.action
	 * 
	 * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
	 * 正确返回：{"success":true,"total":"记录数","datalist":[V_SelCourseSExt]}
	 *
	 */
	
	//==================================================================================================================
	// 查询选课计划
	//------------------------------------------------------------------------------------------------------------------
	/**<pre>
	 *   功能：查询选课计划
	 * 使用者：学生
	 *
	 * URL：p/stuXk!quePlan.action
	 *
	 * 参数
	 * termId     可选   学期Id
	 * planName   可选   计划名称
	 * orderFd    可选   排序字段的字段名称，倒序前面加“@”
	 *
	 * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
	 * 正确返回：{"success":true,"total":"总记录数","datalist":[XkPlan]}
	 *
	 * 相关接口：p/xkp!query.action
	 *
	 */

	//==================================================================================================================
	// 查询可选课程
	//------------------------------------------------------------------------------------------------------------------
	/**<pre>
	 *   功能：查询可选课程
	 * 使用者：学生
	 *
	 * URL：p/stuXk!queCou.action
	 *
	 * 参数：
	 * start      可选   记录开始位置
	 * limit      可选   获取记录数量
	 * xkpId      可选   选课计划Id
	 * couType    可选   课程类型 系统代码11 2普通(默认) 4自修研习
	 * couNO      可选   课程编号
	 * couName    可选   课程名称
	 * orderFd    可选   排序字段的字段名称，倒序前面加“@”
	 * type       可选   1=返回所有课程、2=返回可选课程(包括人数已满)、3=返回可选课程(不含人数已满)(默认)
	 *
	 * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
	 * 正确返回：{"success":true,"total":"总记录数","datalist":[V_SelCourseSExt]}
	 *
	 * 相关接口：p/selCou!stuQue.action，可以进行更详细的查询，但性能会差些
	 *
	 * 注：couState 用来返回 -- 同班学生(包括自己)，当前选择该课的人数
	 * 注：audit    用来返回 -- 学生当前选课状态：0未选、1预选、2选中、3确认
	 *
	 */

    //==================================================================================================================
    // 学生选课
    //------------------------------------------------------------------------------------------------------------------
    /**<pre>
     *   功能：学生选课
	 * 使用者：学生
	 *
	 * URL：p/stuXk!selCou.action
     *
     * 参数：
     * selCouId   必需   待选课Id
     * type       可选   1=自动清除之前选的课程，默认不清除；已经确认的课程是无法清除的
     *
	 * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
     * 正确返回：{"success":true,"message":"成功信息"}
     *
     */


    //==================================================================================================================
    // 学生取消选课
    //------------------------------------------------------------------------------------------------------------------
    /**<pre>
     *   功能：学生取消选课
     * 使用者：学生
     *
	 * URL：p/stuXk!unSelCou.action
     *
     * 参数：
     * selCouId    必需   待选课Id
     *
	 * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
     * 正确返回：{"success":true,"message":"成功信息"}
     *
     */

	//==================================================================================================================
