/** 师生互评 */

	/** 学生选课Id   */ private Integer   stuCouId   ;
	/** 老师评价     */ private Integer   evalStu    ; //系统代码81 2未评(默认) 4差评 6及格 8良好 10优秀
	/** 老师评语     */ private String    evalStuTxt ;
	/** 教师评价时间 */ private Timestamp evalStuTime;
	/** 取得学分     */ private Double    credit     ;
	/** 学生评教1    */ private Integer   evalCou1   ; //2未评(默认) 4普通 6满意 8很好 代码82
	/** 学生评教2    */ private Integer   evalCou2   ; //2未评(默认) 4普通 6满意 8很好 代码82
	/** 学生评教3    */ private Integer   evalCou3   ; //2未评(默认) 4普通 6满意 8很好 代码82
	/** 学生总评     */ private Integer   evalCou    ; //2未评(默认) 4普通 6满意 8很好 代码82
	/** 学生评语     */ private String    evalCouTxt ;
	/** 学生评价时间 */ private Timestamp evalCouTime;
	/** 互评状态     */ private Byte      evalState  ; //2普通(默认)、3确认

	/** 学生Id       */ private Integer   stuId       ;
	/** 学期Id       */ private Integer   termId      ;
	/** 待选课Id     */ private Integer   selCouId    ;
	/** 选课状态     */ private Byte      state       ; //1预选 2选中(默认) 3确认
	/** 教师评价控制 */ private Byte      evalStateThr; //1不可评(默认) 2可评价
	/** 学生评价控制 */ private Byte      evalStateStu; //1不可评(默认) 2可评价
	/** 学生操作状态 */ private Byte      stuOpState  ; //1不可见(默认)、2可见、3可评价
	/** 委员操作状态 */ private Byte      memOpState  ; //1不可见(默认)、2可见、3可评价
	/** 开课状态     */ private Byte      couState    ; //2开启(可选)(默认) 3关闭(不可选) 4确认 5完成
	/** 审核状态     */ private Byte      audit       ; //1未审核(默认) 2已审核
	
	/** 排序字段         */ private String[] orderFd  ; //排序字段的名称，倒序前面加“@”，可以多个
	/** 学生选课Id(多个) */ private String   stuCouIds; //多个Id用“,”隔开

	//==================================================================================================================
	// 查询
	//------------------------------------------------------------------------------------------------------------------
	/**<pre>
	 *   功能：查询
	 * 使用者：
	 *
	 * URL：p/stuCouEval!query.action
	 *
	 * 参数
	 * start        可选   记录开始位置
	 * limit        可选   获取记录数量
	 * stuCouId     可选   学生选课Id
	 * evalStu      可选   老师评价 系统代码81 2未评(默认) 4差评 6及格 8良好 10优秀
	 * evalStuTxt   可选   老师评语
	 * credit       可选   取得学分
	 * evalCou1     可选   学生评教1 2未评(默认) 4普通 6满意 8很好 代码82
	 * evalCou2     可选   学生评教2 2未评(默认) 4普通 6满意 8很好 代码82
	 * evalCou3     可选   学生评教3 2未评(默认) 4普通 6满意 8很好 代码82
	 * evalCou      可选   学生总评 2未评(默认) 4普通 6满意 8很好 代码82
	 * evalCouTxt   可选   学生评语
	 * evalState    可选   互评状态 2普通(默认)、3确认
	 * orderFd      可选   排序字段的字段名称，倒序前面加“@”
	 *
	 * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
	 * 正确返回：{"success":true,"total":"总记录数","datalist":[StuCouEval]}
	 *
	 */

	//==================================================================================================================
	// 查询2 -- 引入：选课结果 
	//------------------------------------------------------------------------------------------------------------------
	/**<pre>
	 *   功能：查询2 -- 引入：选课结果
	 * 使用者：
	 *
	 * URL：p/stuCouEval!query2.action
	 *
	 * 参数
	 * start         可选   记录开始位置
	 * limit         可选   获取记录数量
	 * stuCouId      可选   学生选课Id
	 * evalStu       可选   老师评价 系统代码81 2未评(默认) 4差评 6及格 8良好 10优秀
	 * evalStuTxt    可选   老师评语
	 * credit        可选   取得学分
	 * evalCou1      可选   学生评教1 2未评(默认) 4普通 6满意 8很好 代码82
	 * evalCou2      可选   学生评教2 2未评(默认) 4普通 6满意 8很好 代码82
	 * evalCou3      可选   学生评教3 2未评(默认) 4普通 6满意 8很好 代码82
	 * evalCou       可选   学生总评 2未评(默认) 4普通 6满意 8很好 代码82
	 * evalCouTxt    可选   学生评语
	 * evalState     可选   互评状态 2普通(默认)、3确认
	 * stuId         可选   学生Id
	 * termId        可选   学期Id
	 * selCouId      可选   待选课Id
	 * state         可选   选课状态 1预选 2选中(默认) 3确认
	 * evalStateThr  可选   教师评价控制 1不可评(默认) 2可评价
	 * evalStateStu  可选   学生评价控制 1不可评(默认) 2可评价
	 * stuOpState    可选   学生操作状态 1不可见(默认)、2可见、3可评价
	 * memOpState    可选   委员操作状态 1不可见(默认)、2可见、3可评价
	 * couState      可选   开课状态 2开启(可选)(默认) 3关闭(不可选) 4确认 5完成
	 * audit         可选   审核状态 1未审核(默认) 2已审核
	 * orderFd       可选   排序字段的字段名称，倒序前面加“@”
	 *
	 * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
	 * 正确返回：{"success":true,"total":"总记录数","datalist":[V_StuCouEval]}
	 *
	 */
	
	//==================================================================================================================
	// 我的课程评价
	//------------------------------------------------------------------------------------------------------------------
	/**<pre>
	 *   功能：我的课程评价
	 * 使用者：开课教师、合作机构
	 *
	 * URL：p/stuCouEval!myCouEval.action
	 *
	 * 参数：参数query2
	 *
	 * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
	 * 正确返回：{"success":true,"total":"总记录数","datalist":[V_StuCouEval]}
	 *
	 */

	//==================================================================================================================
	// 专业委员查询
	//------------------------------------------------------------------------------------------------------------------
	/**<pre>
	 *  功能：专业委员查
	 * 使用者：专业委员
	 *
	 * URL：p/stuCouEval!memQue.action
	 *
	 * 参数：参数query
	 *
	 * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
	 * 正确返回：{"success":true,"total":"总记录数","datalist":[V_StuCouEval]}
	 *
	 */

	//==================================================================================================================
	// 学生查询
	//------------------------------------------------------------------------------------------------------------------
	/**<pre>
	 *   功能：学生查询：学生已评、且课程被设置为学生可见
	 * 使用者：学生
	 *
	 * URL：p/stuCouEval!stuQue.action
	 *
	 * 参数：参数query
	 *
	 * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
	 * 正确返回：{"success":true,"total":"总记录数","datalist":[V_StuCouEval]}
	 *
	 */

	//==================================================================================================================
	// 更新评价记录 -- 管理级
	//------------------------------------------------------------------------------------------------------------------
	/**<pre>
	 *   功能：更新评价记录 -- 管理级
	 * 使用者：
	 *
	 * URL：p/stuCouEval!upRec.action
	 *
	 * 参数
	 * stuCouId     必需   学生选课Id
	 * evalStu      可选   老师评价 系统代码81 2未评(默认) 4差评 6及格 8良好 10优秀
	 * evalStuTxt   可选   老师评语
	 * evalStuTime  可选   教师评价时间
	 * credit       可选   取得学分 默认自动获取
	 * evalCou1     可选   学生评教1 2未评(默认) 4普通 6满意 8很好 代码82
	 * evalCou2     可选   学生评教2 2未评(默认) 4普通 6满意 8很好 代码82
	 * evalCou3     可选   学生评教3 2未评(默认) 4普通 6满意 8很好 代码82
	 * evalCou      可选   学生总评 2未评(默认) 4普通 6满意 8很好 代码82
	 * evalCouTxt   可选   学生评语
	 * evalCouTime  可选   学生评价时间
	 * evalState    可选   互评状态 2普通(默认)、3确认
	 *
	 * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
	 * 正确返回：{"success":true,"data":{StuCouEval}}
	 *
	 */

	//==================================================================================================================
	// 状态控制
	//------------------------------------------------------------------------------------------------------------------
	/**<pre>
	 *   功能：状态控制
	 * 使用者：
	 *
	 * URL：p/stuCouEval!chState.action
	 *
	 * 参数
	 * stuCouIds    必需   学生选课Id 多个用“,”隔开
	 * evalState    必需   互评状态 2普通(默认)、3确认
	 *
	 * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
	 * 正确返回：{"success":true,"message":"成功信息"}
	 *
	 */

	//==================================================================================================================
	// 教师评价学生
	//------------------------------------------------------------------------------------------------------------------
	/**<pre>
	 *   功能：教师评价学生
	 * 使用者：开课教师
	 *
	 * URL：p/stuCouEval!thrEvalStu.action
	 *
	 * 参数
	 * stuCouId     必需   学生选课Id
	 * evalStu      必需   老师评价 系统代码81 2未评(默认) 4差评 6及格 8良好 10优秀
	 * evalStuTxt   可选   老师评语
	 * evalStuTime  可选   教师评价时间 默认取当前时间
	 *
	 * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
	 * 正确返回：{"success":true,"data":{StuCouEval}}
	 *
	 */

	//==================================================================================================================
	// 学生评价课程
	//------------------------------------------------------------------------------------------------------------------
	/**<pre>
	 *   功能：学生评价课程
	 * 使用者：学生
	 *
	 * URL：p/stuCouEval!stuEvalCou.action
	 *
	 * 参数
	 * stuCouId     必需   学生选课Id
	 * evalCou1     可选   学生评教1 2未评(默认) 4普通 6满意 8很好 代码82
	 * evalCou2     可选   学生评教2 2未评(默认) 4普通 6满意 8很好 代码82
	 * evalCou3     可选   学生评教3 2未评(默认) 4普通 6满意 8很好 代码82
	 * evalCou      必需   学生总评 2未评(默认) 4普通 6满意 8很好 代码82
	 * evalCouTxt   可选   学生评语
	 * evalCouTime  可选   学生评价时间 默认取当前时间
	 *
	 * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
	 * 正确返回：{"success":true,"data":{StuCouEval}}
	 *
	 */
	
	//==================================================================================================================
