/** 课程评价 */

	/** 待选课Id       */ private Integer selCouId    ;
	/** 学期Id         */ private Integer termId      ;
	/** 教师自评价     */ private Integer selfEval    ; //系统代码82 2未评(默认) 4普通 6满意 8很好
	/** 教师自评语     */ private String  selfEvalTxt ;
	/** 学校评价       */ private Integer schEval     ; //系统代码82 2未评(默认) 4普通 6满意 8很好
	/** 学校评语       */ private String  schEvalTxt  ;
	/** 机构评价       */ private Integer socEval     ; //系统代码82 2未评(默认) 4普通 6满意 8很好
	/** 机构评语       */ private String  socEvalTxt  ;
	/** 学生评价计数   */ private Short   stuEvalNum  ;
	/** 学生评价累计   */ private Double  stuEvalTotal;
	/** 课程名称       */ private String  couName     ;
	/** 学生操作状态   */ private Byte    stuOpState  ; //1不可见、2可选课(默认)
	/** 委员操作状态   */ private Byte    memOpState  ; //1不可见(默认)、2可见、3可评价
	/** 教师操作状态   */ private Byte    thrOpState  ; //控制教师对学生的评价，2不可评(默认)、3可评价 -- 作废保留
	/** 开课状态       */ private Byte    couState    ; //2开启(可选)(默认) 3关闭(不可选) 4确认 5完成
	/** 审核状态       */ private Byte    audit       ; //1未审核(默认) 2已审核
	/** 学期名称       */ private String  termName    ;
	/** 课程教师Id(组) */ private String  couThrIds   ; //多个用“,”隔开
	/** 教师姓名(组)   */ private String  couThrNms   ; //多个用“,”隔开
	/** 合作机构Id(组) */ private String  socIds      ; //多个用“,”隔开
	/** 机构名称(组)   */ private String  socNms      ; //多个用“,”隔开

	/** 排序字段       */ private String[] orderFd  ; //排序字段的名称，倒序前面加“@”，可以多个
	/** 待选课Id(多个) */ private String   selCouIds; //多个Id用“,”隔开
	/** 教师姓名　　　 */ private String   thrName  ;
	/** 机构名称　  　 */ private String   socName  ;

	//==================================================================================================================
	// 查询
	//------------------------------------------------------------------------------------------------------------------
	/**<pre>
	 *   功能：查询
	 * 使用者：
	 *
	 * URL：p/selCouEval!query.action
	 *
	 * 参数
	 * start         可选   记录开始位置
	 * limit         可选   获取记录数量
	 * selCouIds     可选   待选课Id 多个Id用“,”隔开
	 * termId        可选   学期Id
	 * selfEval      可选   教师自评价 系统代码82 2未评(默认) 4普通 6满意 8很好
	 * selfEvalTxt   可选   教师自评语
	 * schEval       可选   学校评价 系统代码82 2未评(默认) 4普通 6满意 8很好
	 * schEvalTxt    可选   学校评语
	 * socEval       可选   机构评价 系统代码82 2未评(默认) 4普通 6满意 8很好
	 * socEvalTxt    可选   机构评语
	 * stuEvalNum    可选   学生评价计数
	 * stuEvalTotal  可选   学生评价累计
	 *
	 * orderFd       可选   排序字段的字段名称，倒序前面加“@”
	 *
	 * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
	 * 正确返回：{"success":true,"total":"总记录数","datalist":[SelCouEval]}
	 *
	 */

	//==================================================================================================================
	// 查询2 -- 引入：学期名称、课程名称、教师姓名、机构名称
	//------------------------------------------------------------------------------------------------------------------
	/**<pre>
	 *   功能：查询2 -- 引入：学期名称、课程名称、教师姓名、机构名称
	 * 使用者：
	 *
	 * URL：p/selCouEval!query2.action
	 *
	 * 参数
	 * start         可选   记录开始位置
	 * limit         可选   获取记录数量
	 * selCouIds     可选   待选课Id 多个Id用“,”隔开
	 * termId        可选   学期Id
	 * selfEval      可选   教师自评价 系统代码82 2未评(默认) 4普通 6满意 8很好
	 * selfEvalTxt   可选   教师自评语
	 * schEval       可选   学校评价 系统代码82 2未评(默认) 4普通 6满意 8很好
	 * schEvalTxt    可选   学校评语
	 * socEval       可选   机构评价 系统代码82 2未评(默认) 4普通 6满意 8很好
	 * socEvalTxt    可选   机构评语
	 * stuEvalNum    可选   学生评价计数
	 * stuEvalTotal  可选   学生评价累计
	 * couName       可选   课程名称
	 * stuOpState    可选   学生操作状态 1不可见、2可选课(默认)
	 * memOpState    可选   委员操作状态 1不可见(默认)、2可见、3可评价
	 * thrOpState    可选   教师操作状态 控制教师对学生的评价，2不可评(默认)、3可评价 -- 作废保留
	 * couState      可选   开课状态 2开启(可选)(默认) 3关闭(不可选) 4确认 5完成
	 * audit         可选   审核状态 1未审核(默认) 2已审核
	 * couThrIds     可选   课程教师Id(组) 多个用“,”隔开
	 * socIds        可选   合作机构Id(组) 多个用“,”隔开
	 * thrName       可选   教师姓名
	 * socName       可选   机构名称
	 * orderFd       可选   排序字段的字段名称，倒序前面加“@”
	 *
	 * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
	 * 正确返回：{"success":true,"total":"总记录数","datalist":[V_SelCouEval]}
	 *
	 */

	//==================================================================================================================
	// 我的课程评价
	//------------------------------------------------------------------------------------------------------------------
	/**<pre>
	 *   功能：我的课程评价
	 * 使用者：开课教师、合作机构
	 *
	 * URL：p/selCouEval!myCouEval.action
	 *
	 * 参数：参数query2
	 *
	 * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
	 * 正确返回：{"success":true,"total":"总记录数","datalist":[V_SelCouEval]}
	 *
	 */

	//==================================================================================================================
	// 专业委员查询
	//------------------------------------------------------------------------------------------------------------------
	/**<pre>
	 *   功能：专业委员查询
	 * 使用者：专业委员
	 *
	 * URL：p/selCouEval!memQue.action
	 *
	 * 参数：参数query2
	 *
	 * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
	 * 正确返回：{"success":true,"total":"总记录数","datalist":[V_SelCouEval]}
	 *
	 */

	//==================================================================================================================
	// 学生查询
	//------------------------------------------------------------------------------------------------------------------
	/**<pre>
	 *   功能：学生查询
	 * 使用者：学生
	 *
	 * URL：p/selCouEval!stuQue.action
	 *
	 * 参数：参数query2
	 *
	 * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
	 * 正确返回：{"success":true,"total":"总记录数","datalist":[V_SelCouEval]}
	 *
	 */

	//==================================================================================================================
	// 更新评价记录 -- 管理级
	//------------------------------------------------------------------------------------------------------------------
	/**<pre>
	 *   功能：更新评价记录 -- 管理级
	 * 使用者：
	 *
	 * URL：p/selCouEval!upRec.action
	 *
	 * 参数
	 * selCouId      必需   待选课Id
	 * termId        必需   学期Id
	 * selfEval      可选   教师自评价 系统代码82 2未评(默认) 4普通 6满意 8很好
	 * selfEvalTxt   可选   教师自评语
	 * schEval       可选   学校评价 系统代码82 2未评(默认) 4普通 6满意 8很好
	 * schEvalTxt    可选   学校评语
	 * socEval       可选   机构评价 系统代码82 2未评(默认) 4普通 6满意 8很好
	 * socEvalTxt    可选   机构评语
	 *
	 * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
	 * 正确返回：{"success":true,"data":{SelCouEval}}
	 *
	 */

	//==================================================================================================================
	// 教师自评、机构评价
	//------------------------------------------------------------------------------------------------------------------
	/**<pre>
	 *   功能：教师自评、机构评价
	 * 使用者：开课教师、合作机构
	 *
	 * URL：p/selCouEval!myEval.action
	 *
	 * 参数
	 * selCouId      必需   待选课Id
	 * termId        必需   学期Id
	 * selfEval      可选   教师自评价 系统代码82 2未评(默认) 4普通 6满意 8很好
	 * selfEvalTxt   可选   教师自评语
	 * socEval       可选   机构评价 系统代码82 2未评(默认) 4普通 6满意 8很好
	 * socEvalTxt    可选   机构评语
	 *
	 * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
	 * 正确返回：{"success":true,"data":{SelCouEval}}
	 *
	 */

	//==================================================================================================================
	// 专业委员评价
	//------------------------------------------------------------------------------------------------------------------
	/**<pre>
	 *   功能：专业委员评价
	 *
	 * URL：p/selCouEval!memEval.action
	 *
	 * 参数
	 * selCouId      必需   待选课Id
	 * termId        必需   学期Id
	 * schEval       可选   学校评价 系统代码82 2未评(默认) 4普通 6满意 8很好
	 * schEvalTxt    可选   学校评语
	 *
	 * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
	 * 正确返回：{"success":true,"data":{SelCouEval}}
	 *
	 */

	//==================================================================================================================
