/** 选课计划 */

	/** 选课计划Id   */ private Integer   xkpId       ;
	/** 学期Id       */ private Integer   termId      ;
	/** 计划编号     */ private String    planNO      ;
	/** 计划名称     */ private String    planName    ;
	/** 计划说明     */ private String    planMeno    ;
	/** 选课开启时间 */ private Timestamp planStart   ; //不同的课程还可以不同，具体以课程为准
	/** 选课关闭时间 */ private Timestamp planEnd     ; //不同的课程还可以不同，具体以课程为准
	/** 选课完成时间 */ private Timestamp planDone    ;
	/** 单期学分(优) */ private Double    credit1     ;
	/** 单期学分(良) */ private Double    credit2     ;
	/** 单期学分(及) */ private Double    credit3     ;
	/** 优秀比率     */ private Double    lvRate1     ;
	/** 良好比率     */ private Double    lvRate2     ;
	/** 及格比率     */ private Double    lvRate3     ;
	/** 课程录入状态 */ private Byte      couEditState; //1未开放(默认) 2开放新增/编辑 3开放编辑 4关闭
	/** 选课计划状态 */ private Byte      xkpState    ; //1未开启 2开启(默认) 3关闭 4完成

	/** 排序字段         */ private String[] orderFd; //排序字段的名称，倒序前面加“@”，可以多个
	/** 选课计划Id(多个) */ private String   xkpIds ; //多个Id用“,”隔开

	//==================================================================================================================
	// 查询
	//------------------------------------------------------------------------------------------------------------------
	/**<pre>
	 *   功能：查询
	 * 使用者：无限制，但学生只能查开启状态的计划
	 *
	 * URL：p/xkp!query.action
	 *
	 * 参数
	 * start         可选   记录开始位置
	 * limit         可选   获取记录数量
	 * xkpId         可选   选课计划Id
	 * termId        可选   学期Id
	 * planNO        可选   计划编号
	 * planName      可选   计划名称
	 * planMeno      可选   计划说明
	 * credit1       可选   单期学分(优)
	 * credit2       可选   单期学分(良)
	 * credit3       可选   单期学分(及)
	 * lvRate1       可选   优秀比率
	 * lvRate2       可选   良好比率
	 * lvRate3       可选   及格比率
	 * couEditState  可选   课程录入状态 1未开放(默认) 2开放新增/编辑 3开放编辑 4关闭
	 * xkpState      可选   选课计划状态 1未开启 2开启(默认) 3关闭 4完成
	 * orderFd       可选   排序字段的字段名称，倒序前面加“@”
	 *
	 * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
	 * 正确返回：{"success":true,"total":"总记录数","datalist":[XkPlan]}
	 *
	 */

	//==================================================================================================================
	// 新增
	//------------------------------------------------------------------------------------------------------------------
	/**<pre>
	 *   功能：新增
	 * 使用者：
	 *
	 * URL：p/xkp!newRec.action
	 *
	 * 参数
	 * termId        必需   学期Id
	 * planNO        必需   计划编号
	 * planName      必需   计划名称
	 * planMeno      可选   计划说明
	 * planStart     可选   选课开启时间 不同的课程还可以不同，具体以课程为准
	 * planEnd       可选   选课关闭时间 不同的课程还可以不同，具体以课程为准
	 * planDone      可选   选课完成时间
	 * credit1       可选   单期学分(优)
	 * credit2       可选   单期学分(良)
	 * credit3       可选   单期学分(及)
	 * lvRate1       可选   优秀比率
	 * lvRate2       可选   良好比率
	 * lvRate3       可选   及格比率
	 * couEditState  可选   课程录入状态 1未开放(默认) 2开放新增/编辑 3开放编辑 4关闭
	 * xkpState      可选   选课计划状态 1未开启 2开启(默认) 3关闭 4完成
	 *
	 * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
	 * 正确返回：{"success":true,"data":{XkPlan}}
	 *
	 */

	//==================================================================================================================
	// 修改
	//------------------------------------------------------------------------------------------------------------------
	/**<pre>
	 *   功能：修改
	 * 使用者：
	 *
	 * URL：p/xkp!edit.action
	 *
	 * 参数
	 * xkpId         必需   选课计划Id
	 * termId        可选   学期Id
	 * planNO        可选   计划编号
	 * planName      可选   计划名称
	 * planMeno      可选   计划说明
	 * planStart     可选   选课开启时间 不同的课程还可以不同，具体以课程为准
	 * planEnd       可选   选课关闭时间 不同的课程还可以不同，具体以课程为准
	 * planDone      可选   选课完成时间
	 * credit1       可选   单期学分(优)
	 * credit2       可选   单期学分(良)
	 * credit3       可选   单期学分(及)
	 * lvRate1       可选   优秀比率
	 * lvRate2       可选   良好比率
	 * lvRate3       可选   及格比率
	 * couEditState  可选   课程录入状态 1未开放(默认) 2开放新增/编辑 3开放编辑 4关闭
	 * xkpState      可选   选课计划状态 1未开启 2开启(默认) 3关闭 4完成
	 *
	 * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
	 * 正确返回：{"success":true,"message":"成功信息"}
	 *
	 */

    //==================================================================================================================
    // 计划状态控制
    //------------------------------------------------------------------------------------------------------------------
    /**<pre>
     *   功能：课程状态控制
     * 使用者：管理员
     *
     * URL：p/xkp!chState.action
     *
     * 参数：
	 * xkpId         必需   选课计划Id
	 * couEditState  2选1   课程录入状态 1未开放 2开放新增/编辑 3开放编辑 4关闭
	 * xkpState      2选1   选课计划状态 1未开启 2开启(默认) 3关闭 4完成
     *
     * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
     * 正确返回：{"success":true,"message":"成功信息"}
     *
     */

	//==================================================================================================================
	// 删除
	//------------------------------------------------------------------------------------------------------------------
	/**<pre>
	 *   功能：删除  注意：不能删除“2开启 3关闭”这2种状态的数据
	 * 使用者：
	 *
	 * URL：p/xkp!del.action
	 *
	 * 参数
	 * xkpIds   必需   选课计划Id 多个用“,”隔开
	 *
	 * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
	 * 正确返回：{"success":true,"message":"成功信息"}
	 *
	 */

	//==================================================================================================================
