/** 待选课程封面 */



	//==================================================================================================================
	//上传课程封面(POST)
	//------------------------------------------------------------------------------------------------------------------
	/**<pre>
	 *
	 *     功能：上传课程封面
	 *      URL：p/couCover
	 * POST参数：单个文件 或 照片数据
	 *     权限：管理员、课程教师(自己)、课程合作机构(自己)
	 *
	 * URL参数：
	 * couId   必需   课程Id -- 只有管理员有权指定别人的课程Id
	 * type    可选   1 = 上传文件；默认 = 直接上传照片数据
	 *
	 * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
	 * 正确返回：{"success":true}
	 *
	 * 注：上传文件，会对图片进行缩放处理
	 * 注：上传数据，不对图片进行缩放处理
	 *
	 */

	//==================================================================================================================
	// 获取课程封面(GET)
	//------------------------------------------------------------------------------------------------------------------
	/**<pre>
	 *
	 * 功能：获取课程封面
	 *  URL：p/couCover
	 * 权限：无限制
	 *
	 * URL参数：
	 * couId    必需   课程Id
	 * getDef   可选   1 = 没有照片时返回默认照片；默认 = 没有照片时返回错误信息"课程封面未上传"
	 * type     可选   1=原始图(默认)、2=缩略图
	 *
	 * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
	 * 正确返回：图片
	 *
	 */
