/** 教师照片 */



	//==================================================================================================================
	//上传教师照片(POST)
	//------------------------------------------------------------------------------------------------------------------
	/**<pre>
	 *
	 *     功能：上传教师照片
	 *      URL：p/thrPhoto
	 * POST参数：单个文件 或 照片数据
	 *     权限：管理员、教师(自己)
	 *
	 * URL参数：
	 * thrId   可选   教师Id -- 只有管理员有权指定教师Id，为别人上传照片
	 * type    可选   1 = 上传文件；默认 = 直接上传照片数据
	 *
	 * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
	 * 正确返回：{"success":true}
	 *
	 * 注：上传文件，会对图片进行缩放处理
	 * 注：上传数据，不对图片进行缩放处理
	 *
	 */

	//==================================================================================================================
	// 获取教师照片(GET)
	//------------------------------------------------------------------------------------------------------------------
	/**<pre>
	 *
	 * 功能：获取教师照片
	 *  URL：p/thrPhoto
	 * 权限：无限制
	 *
	 * URL参数：
	 * thrId    必需   教师Id -- 教师不指定该参数，将获取自己的照片
	 * getDef   可选   1 = 没有照片时返回默认照片；默认 = 没有照片时返回错误信息"照片未上传"
	 * type     可选   1=原始图(默认)、2=缩略图
	 *
	 * 出错返回：{"success":false,"type":1或2,"message":"错误信息"} 1已知错误、2未知错误
	 * 正确返回：图片
	 *
	 */
